Revit 2027 API
ParameterTypeId.StructuralBeamEndAttachmentRefcolumnEnd Property
 "End of Attachment to Reference Column"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamEndAttachmentRefcolumnEnd { get; }
Public Shared ReadOnly Property StructuralBeamEndAttachmentRefcolumnEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamEndAttachmentRefcolumnEnd {
	ForgeTypeId^ get ();
}
static member StructuralBeamEndAttachmentRefcolumnEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace